app/views/public_recipes/index.html.erb

SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" IN ($1, $2, $3)  [["recipe_id", 7], ["recipe_id", 5], ["recipe_id", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."public" = $1 ORDER BY "recipes"."created_at" DESC  [["public", true]]
SELECT COUNT(*) FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 7]]
---
                <ul class="list-group list-group-flush">
                  <li class="list-group-item">Total food items: <%= public_recipe.recipe_foods.count %></li>