app/controllers/foods_controller.rb

SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1  [["user_id", 2]]
---
  def index
    @foods = Food.where(user_id: current_user.id).includes(:user) # n+1problem fixed

INSERT INTO "foods" ("name", "measurement_unit", "price", "quantity", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "pilau Masala"], ["measurement_unit", "grams"], ["price", 22], ["quantity", 2], ["user_id", 4], ["created_at", "2023-09-16 01:25:56.830257"], ["updated_at", "2023-09-16 01:25:56.830257"]]
---
  def create
    @food = Food.new(food_params)
    @food.user = current_user

    if @food.save

SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1 AND "foods"."id" = $2 LIMIT $3  [["user_id", 4], ["id", 2], ["LIMIT", 1]]
DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 2]]
---
  def destroy
    @food = current_user.foods.find(params[:id])

    if @food.destroy