app/controllers/general_shopping_lists_controller.rb

SELECT "foods".* FROM "foods"
SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1  [["user_id", 4]]
---
  def index
    @foods = Food.all
    @total = 0
    current_user.foods.each do |food|